-- MySQL dump 10.13  Distrib 8.0.31, for Win64 (x86_64)
--
-- Host: 127.0.0.1    Database: assessment
-- ------------------------------------------------------
-- Server version	8.0.31

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `vaeation`
--

DROP TABLE IF EXISTS `vaeation`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `vaeation` (
  `id` int NOT NULL AUTO_INCREMENT,
  `datehour` varchar(200) DEFAULT NULL,
  `employee_id` int DEFAULT NULL,
  `vaeationtype` varchar(200) DEFAULT NULL,
  `datetime` datetime DEFAULT CURRENT_TIMESTAMP,
  PRIMARY KEY (`id`),
  KEY `employee_id_idx` (`employee_id`),
  CONSTRAINT `employee_id` FOREIGN KEY (`employee_id`) REFERENCES `employee` (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=39 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `vaeation`
--

LOCK TABLES `vaeation` WRITE;
/*!40000 ALTER TABLE `vaeation` DISABLE KEYS */;
INSERT INTO `vaeation` VALUES (2,'2,1:1,1,1:1:1:1:1:1:1:1:1',13,'ล่าป่วย:ลากิจ:ลาพักร้อน:วันมาทำงานสาย:ลาคลอด:ลาบวช:ลาอื่นๆ:ขาดงาน:เตือนด้วยวาจา:เตือนด้วยหนังสือ:พักงาน',NULL),(3,'1,1:1,1D1:1:-:-:-:-:-:-:-',14,'ล่าป่วย:ลากิจ:ลาพักร้อน:วันมาทำงานสาย:ลาคลอด:ลาบวช:ลาอื่นๆ:ขาดงาน:เตือนด้วยวาจา:เตือนด้วยหนังสือ:พักงาน',NULL),(4,'-,-:-,-,-:-:-:-:-:-:-:-:-',15,'ล่าป่วย:ลากิจ:ลาพักร้อน:วันมาทำงานสาย:ลาคลอด:ลาบวช:ลาอื่นๆ:ขาดงาน:เตือนด้วยวาจา:เตือนด้วยหนังสือ:พักงาน',NULL),(5,'1,1:1,1,11:11:1:1:1:1:1:1:1',16,'ล่าป่วย:ลากิจ:ลาพักร้อน:วันมาทำงานสาย:ลาคลอด:ลาบวช:ลาอื่นๆ:ขาดงาน:เตือนด้วยวาจา:เตือนด้วยหนังสือ:พักงาน','2022-11-07 09:41:12'),(6,'1,1:1,1,1:1:1:1:1:1:1:1:1',NULL,'ล่าป่วย:ลากิจ:ลาพักร้อน:วันมาทำงานสาย:ลาคลอด:ลาบวช:ลาอื่นๆ:ขาดงาน:เตือนด้วยวาจา:เตือนด้วยหนังสือ:พักงาน','2022-11-08 14:31:57'),(7,'2,2:2,2,2:2:2:2:2:2:2:2:2',NULL,'ล่าป่วย:ลากิจ:ลาพักร้อน:วันมาทำงานสาย:ลาคลอด:ลาบวช:ลาอื่นๆ:ขาดงาน:เตือนด้วยวาจา:เตือนด้วยหนังสือ:พักงาน','2022-11-08 14:35:23'),(8,'3,3:3,3,3:3:3:3:3:-:-:-:-',NULL,'ล่าป่วย:ลากิจ:ลาพักร้อน:วันมาทำงานสาย:ลาคลอด:ลาบวช:ลาอื่นๆ:ขาดงาน:เตือนด้วยวาจา:เตือนด้วยหนังสือ:พักงาน','2022-11-08 14:40:19'),(11,'2,2:2,2,2:2:2:2:2:2:2:2:2',NULL,'ล่าป่วย:ลากิจ:ลาพักร้อน:วันมาทำงานสาย:ลาคลอด:ลาบวช:ลาอื่นๆ:ขาดงาน:เตือนด้วยวาจา:เตือนด้วยหนังสือ:พักงาน','2022-11-08 17:13:37'),(12,'3,3:3,3,-:-:-:-:-:-:-:-:-',NULL,'ล่าป่วย:ลากิจ:ลาพักร้อน:วันมาทำงานสาย:ลาคลอด:ลาบวช:ลาอื่นๆ:ขาดงาน:เตือนด้วยวาจา:เตือนด้วยหนังสือ:พักงาน','2022-11-08 17:15:56'),(13,'4,4:4,4,-:-:-:-:-:-:-:-:-',19,'ล่าป่วย:ลากิจ:ลาพักร้อน:วันมาทำงานสาย:ลาคลอด:ลาบวช:ลาอื่นๆ:ขาดงาน:เตือนด้วยวาจา:เตือนด้วยหนังสือ:พักงาน','2022-11-08 17:17:05'),(17,'4,4:-,-,-:-:-:-:-:-:-:-:-',13,'ล่าป่วย:ลากิจ:ลาพักร้อน:วันมาทำงานสาย:ลาคลอด:ลาบวช:ลาอื่นๆ:ขาดงาน:เตือนด้วยวาจา:เตือนด้วยหนังสือ:พักงาน','2022-11-09 10:15:23'),(20,'1,1:1,1,-:-:-:-:-:-:-:-:-',9,'ล่าป่วย:ลากิจ:ลาพักร้อน:วันมาทำงานสาย:ลาคลอด:ลาบวช:ลาอื่นๆ:ขาดงาน:เตือนด้วยวาจา:เตือนด้วยหนังสือ:พักงาน','2022-11-09 17:14:49'),(21,'1,1:1,1,1:1:1:1:1:1:1:1:1',9,'ล่าป่วย:ลากิจ:ลาพักร้อน:วันมาทำงานสาย:ลาคลอด:ลาบวช:ลาอื่นๆ:ขาดงาน:เตือนด้วยวาจา:เตือนด้วยหนังสือ:พักงาน','2022-11-18 11:25:09'),(22,'1,1:-,-,-:-:-:-:-:-:-:-:-',9,'ล่าป่วย:ลากิจ:ลาพักร้อน:วันมาทำงานสาย:ลาคลอด:ลาบวช:ลาอื่นๆ:ขาดงาน:เตือนด้วยวาจา:เตือนด้วยหนังสือ:พักงาน','2022-11-18 15:44:56'),(23,'1,1:1,1,-:-:-:-:-:-:-:-:-',9,'ล่าป่วย:ลากิจ:ลาพักร้อน:วันมาทำงานสาย:ลาคลอด:ลาบวช:ลาอื่นๆ:ขาดงาน:เตือนด้วยวาจา:เตือนด้วยหนังสือ:พักงาน','2022-11-18 15:54:03'),(24,'1,1:1,1,1:1:1:1:1:1:1:1:1',9,'ล่าป่วย:ลากิจ:ลาพักร้อน:วันมาทำงานสาย:ลาคลอด:ลาบวช:ลาอื่นๆ:ขาดงาน:เตือนด้วยวาจา:เตือนด้วยหนังสือ:พักงาน','2022-11-22 14:40:56'),(25,'-,-:-,-,-:-:-:-:-:-:-:-:-',9,'ล่าป่วย:ลากิจ:ลาพักร้อน:วันมาทำงานสาย:ลาคลอด:ลาบวช:ลาอื่นๆ:ขาดงาน:เตือนด้วยวาจา:เตือนด้วยหนังสือ:พักงาน','2022-11-22 14:42:46'),(26,'-,-:-,-,-:-:-:-:-:-:-:-:-',9,'ล่าป่วย:ลากิจ:ลาพักร้อน:วันมาทำงานสาย:ลาคลอด:ลาบวช:ลาอื่นๆ:ขาดงาน:เตือนด้วยวาจา:เตือนด้วยหนังสือ:พักงาน','2022-11-22 14:46:26'),(27,'2,2:-,-,-:-:-:-:-:-:-:-:-',9,'ล่าป่วย:ลากิจ:ลาพักร้อน:วันมาทำงานสาย:ลาคลอด:ลาบวช:ลาอื่นๆ:ขาดงาน:เตือนด้วยวาจา:เตือนด้วยหนังสือ:พักงาน','2022-11-24 09:15:56'),(28,'-,-:-,-,-:-:-:-:-:-:-:-:-',21,'ล่าป่วย:ลากิจ:ลาพักร้อน:วันมาทำงานสาย:ลาคลอด:ลาบวช:ลาอื่นๆ:ขาดงาน:เตือนด้วยวาจา:เตือนด้วยหนังสือ:พักงาน','2022-11-24 17:02:15'),(29,'-,-:-,-,-:-:-:-:-:-:-:-:-',21,'ล่าป่วย:ลากิจ:ลาพักร้อน:วันมาทำงานสาย:ลาคลอด:ลาบวช:ลาอื่นๆ:ขาดงาน:เตือนด้วยวาจา:เตือนด้วยหนังสือ:พักงาน','2022-11-24 17:04:00'),(30,'-,-:-,-,-:-:-:-:-:-:-:-:-',9,'ล่าป่วย:ลากิจ:ลาพักร้อน:วันมาทำงานสาย:ลาคลอด:ลาบวช:ลาอื่นๆ:ขาดงาน:เตือนด้วยวาจา:เตือนด้วยหนังสือ:พักงาน','2022-11-24 17:04:37'),(31,'-,-:-,-,-:-:-:-:-:-:-:-:-',9,'ล่าป่วย:ลากิจ:ลาพักร้อน:วันมาทำงานสาย:ลาคลอด:ลาบวช:ลาอื่นๆ:ขาดงาน:เตือนด้วยวาจา:เตือนด้วยหนังสือ:พักงาน','2022-11-24 17:05:50'),(32,'-,-:-,-,-:-:-:-:-:-:-:-:-',9,'ล่าป่วย:ลากิจ:ลาพักร้อน:วันมาทำงานสาย:ลาคลอด:ลาบวช:ลาอื่นๆ:ขาดงาน:เตือนด้วยวาจา:เตือนด้วยหนังสือ:พักงาน','2022-11-24 17:07:17'),(33,'-,-:-,-,-:-:-:-:-:-:-:-:-',9,'ล่าป่วย:ลากิจ:ลาพักร้อน:วันมาทำงานสาย:ลาคลอด:ลาบวช:ลาอื่นๆ:ขาดงาน:เตือนด้วยวาจา:เตือนด้วยหนังสือ:พักงาน','2022-11-24 17:20:47'),(34,'-,-:-,-,--:-:-:-:-:-:-:-:-',9,'ล่าป่วย:ลากิจ:ลาพักร้อน:วันมาทำงานสาย:ลาคลอด:ลาบวช:ลาอื่นๆ:ขาดงาน:เตือนด้วยวาจา:เตือนด้วยหนังสือ:พักงาน','2022-11-24 17:21:11'),(35,'-,-:-,-,-:-:-:-:-:-:-:-:-',9,'ล่าป่วย:ลากิจ:ลาพักร้อน:วันมาทำงานสาย:ลาคลอด:ลาบวช:ลาอื่นๆ:ขาดงาน:เตือนด้วยวาจา:เตือนด้วยหนังสือ:พักงาน','2022-11-25 09:16:03'),(36,'1,-:-,-,-:-:-:-:-:-:-:-:-',9,'ล่าป่วย:ลากิจ:ลาพักร้อน:วันมาทำงานสาย:ลาคลอด:ลาบวช:ลาอื่นๆ:ขาดงาน:เตือนด้วยวาจา:เตือนด้วยหนังสือ:พักงาน','2022-11-28 13:32:57'),(37,'-,-:-,-,-:-:-:-:-:-:-:-:-',13,'ล่าป่วย:ลากิจ:ลาพักร้อน:วันมาทำงานสาย:ลาคลอด:ลาบวช:ลาอื่นๆ:ขาดงาน:เตือนด้วยวาจา:เตือนด้วยหนังสือ:พักงาน','2022-11-28 13:38:42'),(38,'1,1:1,1,1:1:1:1:1:1:1:1:1',20,'ล่าป่วย:ลากิจ:ลาพักร้อน:วันมาทำงานสาย:ลาคลอด:ลาบวช:ลาอื่นๆ:ขาดงาน:เตือนด้วยวาจา:เตือนด้วยหนังสือ:พักงาน','2022-11-29 09:47:19');
/*!40000 ALTER TABLE `vaeation` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2023-02-02  9:16:04
